0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.25 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.25 0 0);
    }

    outlet
    {
        type            inletOutlet;
	inletValue	uniform (0.25 0 0);
	value		uniform (0 0 0);
    }

    frontandback
    {
        type            empty;
    }

    bot
    {
	type		noSlip;
    }

    top
    {
	type		slip;

    }
}


// ************************************************************************* //
