0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 8.46e-06;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		uniform 8.46e-06;
    }

    outlet
    {
	type		zeroGradient;
    }

    bot
    {
	type		epsilonWallFunction;
	value		uniform 8.46e-06;
    }

    top
    {
	type		freestream;
	freestreamValue	uniform 8.46e-06;
    }

    frontandback
    {
	type		empty;
	//type		zeroGradient;
    }
}


// ************************************************************************* //
