0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.34e-04;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		uniform 2.34e-04;
    }

    outlet
    {
	//type		zeroGradient;
	type		inletOutlet;
	inletValue	$internalField;
    }

    top
    {
	type		fixedValue;
	value		uniform 2.34e-04;
    }

    bot
    {
	type		fixedValue;
	value		uniform 0;
	//type		kqRWallFunction;
	//value		uniform 2.34e-04;
    }

    frontandback
    {
	type		empty;
	//type		freestream;
	//freestreamValue	uniform 3.75e-05;
    }

}


// ************************************************************************* //
