0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type		calculated;
	value		uniform 0;
    }

    outlet
    {
	type 		calculated;
	value		uniform 0;
    }

    top
    {
	type		zeroGradient;
    }

    bot
    {
	type		nutkWallFunction;
	value		uniform 1e-10;
    }

    frontandback
    {
	type		empty;
	//type		zeroGradient;
    }
}

// ************************************************************************* //
