0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type	zeroGradient;
    }

    outlet
    {
	type	inletOutlet;
	inletValue	uniform 0;
	value		uniform 0;
    }

    top
    {
	type		fixedValue;
	value		uniform 0;
    }

    bot
    {
	type		zeroGradient;
    }

    frontandback
    {
	type		empty;
    }

}


// ************************************************************************* //
