system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-09;
        relTol          1e-09;
        smoother        GaussSeidel;
	nPreSweeps	0;
	nPostSweeps	2;
	cacheAgglomeration	on;
	nCellsInCoarsestLevel	10;
	mergeLevels	1;
    }

   // pFinal
   // {
     //   $p;
      //  tolerance       1e-06;
       // relTol          0;
   // }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-09;
        relTol          1e-09;
    }
}

SIMPLE
{
 //   nCorrectors     2;
    nNonOrthogonalCorrectors 0;
   // pRefCell        0;
   // pRefValue       0;
}

relaxationFactors
{
    fields
    {
	p		0.3;
    }

    equations
    {
	U		0.7;
	k		0.7;
	epsilon		0.7;
	R		0.7;
	nuTilda		0.7;
    }
}

// ************************************************************************* //
